package com.trivia.questions;

public class History extends Questions {
    private String[] questionsArray = {
            "Ποιά χρονιά βυθίστηκε ο Τιτανικός?\n1)1912\n2)1914\n3)1916\n",
            "Πότε έγινε η απόβαση της Νορμανδίας?\n1)6 Ιουνιου 1944\n2)6 Ιουλίου 1944\n3)26 Μαρτίου 1944\n",
            "Μέρος ποιού πολέμου ήταν η εισβολή του Fort Sumter?\n1)Ισπανό-Αμερικανικού\n2)Αμερικανικού εμφυλίου\n3)Αμερικανικής επανάστασης\n",
            "Σε ποιά πόλη της Αμερικής κυριαρχούσε ο Αλ Καπόνε την δεκαετία του 1920?\n1)Σαν Φρανσίσκο\n2)Σπρινγκφιλντ\n3)Σικάγο\n",
            "Σε ποιά μάχη ηττήθηκε ο Ναπολέον Βοναπάρτης?\n1)Βατερλό\n2)Γουάγκραμ\n3)Μόσχα\n",
            "Ποιός ήταν ο πρώτος Ρωμαιο-Καθολικός πρόεδρος των ΗΠΑ?\n1)Τόμας Τζέφερσον\n2)Τζον Φ. Κέννεντυ\n3)Αβράαμ Λίνκολν\n",
            "Έχω βρεθεί στην κορυφή του βουνού..ήταν το όνομα της τελευταίας ομιλίας του..\n1)Γουίνστον Τσέρτσιλ\n2)Τζον Φ. Κέννεντυ\n3)Μάρτιν Λούθερ Κινγκ Τζρ.\n",
            "Ποιά ήταν η πρώτη γυναίκα που εκλέχθηκε να ηγηθεί σε Ευρωπαική Δημοκρατία?\n1)Μαίρη Ρόμπινσον\n2)Μάργκαρετ Θάτσερ\n3)Άνγκελα Μέρκελ\n",
            "Από ποιόν πήρε την εξουσία ο Ιντί Αμίν το 1971?\n1)Μίλτον Ομπότε\n2)Γιούσουφ Λουλέ\n3)Τζούλιους Ναϊρέρε\n",
            "Ποία υπηρεσία παραδώσεων μεταξύ Μιζούρι και Καλιφόρνιας λειτουργούσε το 1986?\n1)Πόνυ Εξπρές\n2)Πόσταλ Εξπρές\n3)Πάινιρ Εξπρές\n"
    };

    private String[] answersArray = {
            "1",
            "1",
            "2",
            "3",
            "1",
            "2",
            "3",
            "2",
            "1",
            "1"
    };


    @Override
    public String[] getQuestionsArray() {
        return questionsArray;
    }

    @Override
    public void setQuestionsArray(String[] questionsArray) {
        this.questionsArray = questionsArray;
    }

    @Override
    public String[] getAnswersArray() {
        return answersArray;
    }

    @Override
    public void setAnswersArray(String[] answersArray) {
        this.answersArray = answersArray;
    }
}
